const giftList = [
  '《现实不似你所见》—— 作者:卡洛.罗韦利',
  '《万物解释者:复杂事物的极简说明书》—— 作者:兰道尔.门罗',
  '《走近费曼丛书.费曼讲物理:入门》—— 作者:理查德.费曼',
  '《非对称风险》—— 作者:纳西姆.尼古拉斯.塔勒布',
  '《随机生存的智慧:黑天鹅语录》—— 作者:纳西姆.尼古拉斯.塔勒布',
  '《自上而下》—— 作者:马特.里德利',
  '《基因组:生命指数23章》—— 作者:马特.里德利',
  '《理性乐观派》—— 作者:马特.里德利',
  '《美德的起源:人类本能与协作的进化》—— 作者:马特.里德利',
  '《红色皇后》—— 作者:马特.里德利',
  '《人类简史:从动物到上帝》—— 作者:尤瓦尔.赫拉利',
  '《无穷的开始:世界进步的本源》—— 作者:代维.多伊奇',
  '《中纪委推荐:历史的教训》—— 作者:威尔杜兰特 阿里尔杜兰特',
  '《生命之书:365天的静心冥想》—— 作者:克里希那穆提',
  '《沉思录》—— 作者:马可.奥勒留',
  '《给忙碌者的天体物理学》—— 作者:尼尔.德格拉斯.泰森',
];
const friendList = ['郑妹', '芳烜', '橋裡', '小颖', 'ZC'];
const n = friendList.length;
const m = giftList.length;

const res = new Map();

const getRandomIndex = (min, max) => {
  return Math.round(Math.random() * max + min);
};

for (let i = 0; i < n; i++) {
  const name = friendList[i]; // 人名
  const index = getRandomIndex(0, giftList.length - 1);
  const bookName = giftList.splice(index, 1)[0];
  res.set(name, bookName);
}

console.log(res);

// Map(5) {
//   '郑妹' => '《生命之书:365天的静心冥想》—— 作者:克里希那穆提',
//   '芳烜' => '《红色皇后》—— 作者:马特.里德利',
//   '橋裡' => '《走近费曼丛书.费曼讲物理:入门》—— 作者:理查德.费曼',
//   '小颖' => '《随机生存的智慧:黑天鹅语录》—— 作者:纳西姆.尼古拉斯.塔勒布',
//   'ZC' => '《人类简史:从动物到上帝》—— 作者:尤瓦尔.赫拉利'
// }

console.log('\n');
console.log('\n');
console.log('\n');
console.log('\n');
console.log('\n');
console.log(giftList);

const noChose = [
  '《现实不似你所见》—— 作者:卡洛.罗韦利',
  '《万物解释者:复杂事物的极简说明书》—— 作者:兰道尔.门罗',
  '《非对称风险》—— 作者:纳西姆.尼古拉斯.塔勒布',
  '《自上而下》—— 作者:马特.里德利',
  '《基因组:生命指数23章》—— 作者:马特.里德利',
  '《理性乐观派》—— 作者:马特.里德利',
  '《美德的起源:人类本能与协作的进化》—— 作者:马特.里德利',
  '《无穷的开始:世界进步的本源》—— 作者:代维.多伊奇',
  '《中纪委推荐:历史的教训》—— 作者:威尔杜兰特 阿里尔杜兰特',
  '《沉思录》—— 作者:马可.奥勒留',
  '《给忙碌者的天体物理学》—— 作者:尼尔.德格拉斯.泰森',
];
